#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/7tv/seventv-eventapi-test/runs/run-L3DK5es9HePBqALx

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 0s
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=seventv-infra-test]
data.aws_eks_cluster.cluster: Read complete after 0s [id=seventv-infra-test]
kubernetes_secret.app: Refreshing state... [id=eventapi/eventapi]
kubernetes_namespace.app: Refreshing state... [id=eventapi]
kubernetes_service.app: Refreshing state... [id=eventapi/eventapi]
kubernetes_deployment.app: Refreshing state... [id=eventapi/eventapi]
kubernetes_ingress_v1.app: Refreshing state... [id=eventapi/eventapi]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_deployment.app will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "eventapi/eventapi"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/seventv/eventapi:test-9286a1a9d2d1ff104129a2b54df7e45858520de8" -> "ghcr.io/seventv/eventapi:test-d69d1086b56f1eca67a9a76e644380c2b857a7e7"
                        name                       = "eventapi"
                        # (8 unchanged attributes hidden)

                        # (10 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # kubernetes_horizontal_pod_autoscaler_v2.eventapil will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "eventapil" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eventapi"
          + namespace        = "eventapi"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 100
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "External"

              + resource {
                  + name = "events_v3_current_connections"

                  + target {
                      + type  = "Value"
                      + value = "10000"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "eventapi"
            }
        }
    }

  # kubernetes_ingress_v1.app will be updated in-place
  ~ resource "kubernetes_ingress_v1" "app" {
        id     = "eventapi/eventapi"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "external-dns.alpha.kubernetes.io/hostname"           = "seventv-infra-test-tunnel-origin.7tv.foo" -> null
              + "external-dns.alpha.kubernetes.io/target"             = "seventv-infra-test-tunnel-origin.7tv.foo"
                # (2 unchanged elements hidden)
            }
            name             = "eventapi"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.


```

</details>

*Actor: @AnatoleAM, Action: `pull_request`, Workflow: `EventAPI CI`*